; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=39, remove_proportion=0.2, bases=7, instance_id=23, output=./training, seed=64

(define (problem warehouse-23)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 box30 box31 box32 box33 box34 box35 box36 box37 box38 box39 - box
        base1 base2 base3 base4 base5 base6 base7 - base
    )
    (:init
        (to-remove box2)
        (to-remove box8)
        (to-remove box14)
        (to-remove box18)
        (to-remove box26)
        (to-remove box31)
        (to-remove box35)
        (clear box12)
        (on box12 box18)
        (on box18 box25)
        (on box25 box27)
        (on box27 box33)
        (on box33 box22)
        (on box22 box35)
        (on box35 box19)
        (on box19 box23)
        (on-base box23 base1)
        (clear box39)
        (on box39 box16)
        (on box16 box6)
        (on box6 box11)
        (on box11 box30)
        (on box30 box24)
        (on box24 box32)
        (on-base box32 base2)
        (clear box29)
        (on-base box29 base3)
        (clear box38)
        (on box38 box20)
        (on box20 box14)
        (on box14 box37)
        (on box37 box15)
        (on-base box15 base4)
        (clear box28)
        (on box28 box31)
        (on box31 box26)
        (on-base box26 base5)
        (clear box10)
        (on box10 box1)
        (on box1 box17)
        (on box17 box3)
        (on box3 box7)
        (on box7 box21)
        (on-base box21 base6)
        (clear box34)
        (on box34 box9)
        (on box9 box8)
        (on box8 box4)
        (on box4 box36)
        (on box36 box5)
        (on box5 box13)
        (on box13 box2)
        (on-base box2 base7)
    )
    (:goal (and 
        (removed box2)
        (removed box8)
        (removed box14)
        (removed box18)
        (removed box26)
        (removed box31)
        (removed box35)
    ))
)

; plan
1. (move box12 box18 box10)
   deleted: (clear box10) (on box12 box18)
   added: (on box12 box10) (clear box18)
   goals met: 0 of 7
2. (move box28 box31 box12)
   deleted: (clear box12) (on box28 box31)
   added: (on box28 box12) (clear box31)
   goals met: 0 of 7
3. (remove box18 box25)
   deleted: (on box18 box25) (clear box18)
   added: (removed box18) (clear box25)
   goals met: 1 of 7
4. (move box25 box27 box28)
   deleted: (clear box28) (on box25 box27)
   added: (on box25 box28) (clear box27)
   goals met: 1 of 7
5. (move box27 box33 box25)
   deleted: (clear box25) (on box27 box33)
   added: (on box27 box25) (clear box33)
   goals met: 1 of 7
6. (move box33 box22 box27)
   deleted: (clear box27) (on box33 box22)
   added: (on box33 box27) (clear box22)
   goals met: 1 of 7
7. (move box22 box35 box29)
   deleted: (clear box29) (on box22 box35)
   added: (on box22 box29) (clear box35)
   goals met: 1 of 7
8. (move box34 box9 box22)
   deleted: (clear box22) (on box34 box9)
   added: (on box34 box22) (clear box9)
   goals met: 1 of 7
9. (remove box31 box26)
   deleted: (on box31 box26) (clear box31)
   added: (removed box31) (clear box26)
   goals met: 2 of 7
10. (remove-from-base box26 base5)
   deleted: (on-base box26 base5) (clear box26)
   added: (removed box26) (clear-base base5)
   goals met: 3 of 7
11. (move box38 box20 box33)
   deleted: (clear box33) (on box38 box20)
   added: (on box38 box33) (clear box20)
   goals met: 3 of 7
12. (move box20 box14 box34)
   deleted: (clear box34) (on box20 box14)
   added: (on box20 box34) (clear box14)
   goals met: 3 of 7
13. (remove box14 box37)
   deleted: (on box14 box37) (clear box14)
   added: (removed box14) (clear box37)
   goals met: 4 of 7
14. (move box9 box8 box20)
   deleted: (clear box20) (on box9 box8)
   added: (on box9 box20) (clear box8)
   goals met: 4 of 7
15. (remove box35 box19)
   deleted: (on box35 box19) (clear box35)
   added: (removed box35) (clear box19)
   goals met: 5 of 7
16. (remove box8 box4)
   deleted: (on box8 box4) (clear box8)
   added: (removed box8) (clear box4)
   goals met: 6 of 7
17. (move box4 box36 box19)
   deleted: (clear box19) (on box4 box36)
   added: (on box4 box19) (clear box36)
   goals met: 6 of 7
18. (move box36 box5 box37)
   deleted: (clear box37) (on box36 box5)
   added: (on box36 box37) (clear box5)
   goals met: 6 of 7
19. (move box5 box13 box36)
   deleted: (clear box36) (on box5 box13)
   added: (on box5 box36) (clear box13)
   goals met: 6 of 7
20. (move box13 box2 box38)
   deleted: (clear box38) (on box13 box2)
   added: (on box13 box38) (clear box2)
   goals met: 6 of 7
21. (remove-from-base box2 base7)
   deleted: (on-base box2 base7) (clear box2)
   added: (removed box2) (clear-base base7)
   goals met: 7 of 7
